// Напишите программу, которая принимает на вход пятизначное число
// и проверяет, является ли оно палиндромом
// 14212 - нет, 23432 - да, 12821 - да

void CheckNumber(int number)
{
    int theFirstFigure = number;
    int theLastFigure = number;
    
}


Console.Write("Введите пятизначное число: ");
int number = int.Parse(Console.ReadLine());
CheckNumber(number);